app/lib/day.rb

SELECT "holidays".* FROM "holidays" WHERE "holidays"."date" BETWEEN $1 AND $2  [["date", "2022-11-01 00:00:00"], ["date", "2022-11-01 23:59:59.999999"]]
SELECT "other_events".* FROM "other_events" WHERE "other_events"."start_time" BETWEEN $1 AND $2  [["start_time", "2022-11-01 00:00:00"], ["start_time", "2022-11-01 23:59:59.999999"]]
SELECT "class_periods".* FROM "class_periods" WHERE "class_periods"."start_time" BETWEEN $1 AND $2  [["start_time", "2022-11-01 00:00:00"], ["start_time", "2022-11-01 23:59:59.999999"]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."due_date" BETWEEN $1 AND $2  [["due_date", "2022-11-01 00:00:00"], ["due_date", "2022-11-01 23:59:59.999999"]]
---
    def load_events
        #load each type of event
        today_events = Holiday.all.where(date: @today.all_day) +
                        OtherEvent.all.where(start_time: @today.all_day) +
                        ClassPeriod.all.where(start_time: @today.all_day) +
                        Assignment.all.where(due_date: @today.all_day)