app/lib/day.rb

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def load_events
        #load each type of event
        #Find user
        #user.calendars then go to holdya table and look for those
        today_events = []
        calendars = UserCalendar.where(user_id: @user_id)
        calendars.each do |cal|