app/views/assignments/_form.html.erb

SELECT "calendars".* FROM "calendars"
---
      <%= form.label :calendar_id, style: "display: block" %>
      <%= form.select :calendar_id, Calendar.all.collect { |calendar| [calendar.calendar_name, calendar.calendar_name]}, include_blank:true %>

SELECT "courses".* FROM "courses"
---
      <%= form.label :course_id, style: "display: block" %>
      <%= form.select :course_id, Course.all.collect { |course| [course.name, course.id]}, include_blank:true %>