app/views/calendars/_calendar.html.erb

    <strong>Creator:</strong>
     <%=  User.find_by(id: calendar.user_id).full_name%>
---
SELECT "users".* FROM "users" INNER JOIN "user_calendars" ON "users"."id" = "user_calendars"."user_id" WHERE "user_calendars"."calendar_id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["calendar_id", 1], ["LIMIT", 1]]