app/views/calendars/index.html.erb

    <tbody>
      <% UserCalendar.where(user_id:Current.user.id).each do |calendar| %>
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."user_id" = $1  [["user_id", 2]]
SELECT "users".* FROM "users" INNER JOIN "user_calendars" ON "users"."id" = "user_calendars"."user_id" WHERE "user_calendars"."calendar_id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["calendar_id", 1], ["LIMIT", 1]]

          <td><%= calendar.calendar.description %></td>
          <td><%= User.find_by(id: calendar.calendar.user_id).first_name + " " + User.find_by(id: calendar.calendar.user_id).last_name %></td>
---
SELECT "users".* FROM "users" INNER JOIN "user_calendars" ON "users"."id" = "user_calendars"."user_id" WHERE "user_calendars"."calendar_id" = $1 LIMIT $2  [["calendar_id", 1], ["LIMIT", 11]]