app/views/calendars/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    <%# <% if UserCalendar.exists?(user_id: @current_user.id, calendar_id: @calendar.id) %>
    <% if Calendar.find_by(id: @calendar.id).user_id == Current.user.id %>

SELECT "calendars".* FROM "calendars" WHERE "calendars"."invite_token" = $1 LIMIT $2  [["invite_token", "[FILTERED]"], ["LIMIT", 1]]
---
          <h5 class="mb-1">Click on the link below to copy and share:</h5>
          <input onclick="this.select();document.execCommand('copy');" class="calendar-url" id="cb-link-field" type="text" value="<%= new_calendar_user_calendar_url(@calendar) %>" data-target="invite.url" data-calendar-token="<%= @calendar.invite_token %>"/>