app/views/other_events/_form.html.erb

      <%= form.label :calendar_id, style: "display: block" %>
      <%= form.select :calendar_id, Calendar.all.collect { |calendar| [calendar.calendar_name] } %>
---
SELECT "calendars".* FROM "calendars"