app/views/courses/_form.html.erb

        <%= form.label :calendar_id, style: "display: block" %>
        <%= form.select :calendar_id, CalendarHelper.load_calendars(current_user[:id]), include_blank:true %>
---
SELECT "calendars".* FROM "calendars"