app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments"
---
  def index
    @assignments = Assignment.all

INSERT INTO "assignments" ("name", "assignment_id", "course", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Lu"], ["assignment_id", 1], ["course", nil], ["created_at", "2022-09-23 19:28:56.548166"], ["updated_at", "2022-09-23 19:28:56.548166"]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save
        format.html { redirect_to calendar_course_assignment_path(Calendar.find_by(id: @assignment.calendar_id).invite_token,
          Course.find_by(id: @assignment.course_id).slug, @assignment.slug),
          notice: "Assignment was successfully created." }

UPDATE "assignments" SET "course" = $1, "updated_at" = $2 WHERE "assignments"."id" = $3  [["course", "test"], ["updated_at", "2022-09-23 19:35:07.799206"], ["id", 2]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
SELECT "user_calendars".* FROM "user_calendars" WHERE "user_calendars"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
  def update
    @assignment.slug = nil if @assignment.name != params[:name]
    puts "ccccccccc"
    puts assignment_params
    respond_to do |format|
      if @assignment.update(assignment_params)
        format.html { redirect_to calendar_course_assignment_path(Calendar.find_by(id: @assignment.calendar_id).invite_token,
          Course.find_by(id: @assignment.course_id).slug, @assignment.slug),
          notice: "Assignment was successfully updated." }

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "assignments" WHERE "assignments"."id" = $1  [["id", 980190962]]
---
  def destroy
    prev_calendar_id = Calendar.find_by(id: @assignment.calendar_id)
    @assignment.destroy

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_assignment
      @assignment = Assignment.find(params[:id])