app/controllers/calendars_controller.rb

SELECT "calendars".* FROM "calendars"
---
  def index
    @calendars = Calendar.all

SELECT "calendars".* FROM "calendars" WHERE "calendars"."invite_token" = $1 LIMIT $2  [["invite_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def show
    @calendar = Calendar.find_by_invite_token(params[:invite_token])

INSERT INTO "calendars" ("calendar_name", "user_id", "shared", "invite_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["calendar_name", "test"], ["user_id", 1], ["shared", true], ["invite_token", "[FILTERED]"], ["created_at", "2022-11-04 19:29:17.227922"], ["updated_at", "2022-11-04 19:29:17.227922"]]
---
  def create
    @calendar = Calendar.new(calendar_params)

    respond_to do |format|
      if @calendar.save

DELETE FROM "calendars" WHERE "calendars"."id" = $1  [["id", 17]]
---
  def destroy
    @calendar.destroy

SELECT "calendars".* FROM "calendars" WHERE "calendars"."invite_token" = $1 LIMIT $2  [["invite_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def set_calendar
    # @calendar = Calendar.find_by(params[:token])

    @calendar = Calendar.find_by_invite_token(params[:invite_token])