app/controllers/calendars_controller.rb

  def index
    @calendars = Calendar.where(user_id: current_user.id)
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."user_id" = $1  [["user_id", 2]]