app/controllers/class_periods_controller.rb

SELECT "class_periods".* FROM "class_periods"
---
  def index
    @class_periods = ClassPeriod.all

SELECT "class_periods".* FROM "class_periods" WHERE "class_periods"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @class_period = ClassPeriod.new(class_period_params)

    respond_to do |format|
      if @class_period.save
        format.html { redirect_to calendar_course_class_periods_path(Calendar.find_by(id: @class_period.calendar_id).invite_token,
          Course.find_by(id: @class_period.course_id).slug),
          notice: "Class period was successfully created." }

SELECT "class_periods".* FROM "class_periods" WHERE "class_periods"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    respond_to do |format|
      if @class_period.update(class_period_params)
        format.html { redirect_to calendar_course_class_period_path(Calendar.find_by(id: @class_period.calendar_id).invite_token,
          Course.find_by(id: @class_period.course_id).slug, ClassPeriod.last.id),
          notice: "Class period was successfully updated." }

SELECT "user_calendars".* FROM "user_calendars" WHERE "user_calendars"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "class_periods" WHERE "class_periods"."id" = $1  [["id", 980190962]]
---
  def destroy
    prev_calendar_id = Calendar.find_by(id: @class_period.calendar_id)
    @class_period.destroy

SELECT "class_periods".* FROM "class_periods" WHERE "class_periods"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_class_period
      @class_period = ClassPeriod.find(params[:id])