app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    respond_to do |format|
      if @course.save
        CalendarHelper.generate_class_period(@course.repetition_frequency, @course.name, @course.id, @course.start_date, @course.end_date,
                                           @course.start_time, @course.end_time, @course.calendar_id)
        format.html { redirect_to calendar_course_path(Calendar.find_by(id: @course.calendar_id).invite_token, @course.slug),
          notice: "Course was successfully created." }
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]

  def update
    @course.slug = nil if @course.name != params[:name]
    respond_to do |format|
      if @course.update(course_params)
        format.html { redirect_to calendar_course_path(Calendar.find_by(id: @course.calendar_id).invite_token, @course.slug),
          notice: "Course was successfully updated." }
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]

  def destroy
    prev_calendar_id = Calendar.find_by(id: @course.calendar_id)
    @course.destroy
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 980190962]]