app/controllers/events_controller.rb

INSERT INTO "events" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "efnjehfiajfakjfh"], ["user_id", 1], ["created_at", "2022-09-16 19:30:37.666220"], ["updated_at", "2022-09-16 19:30:37.666220"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save