app/controllers/holidays_controller.rb

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @holiday = Holiday.new(holiday_params)

    respond_to do |format|
      if @holiday.save
        format.html { redirect_to calendar_holiday_path(Calendar.find_by(id: @holiday.calendar_id).invite_token, @holiday.slug),
          notice: "Holiday was successfully created." }

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @holiday.slug = nil if @holiday.name != params[:name]
    respond_to do |format|

      if @holiday.update(holiday_params)
        format.html { redirect_to calendar_path(Calendar.find_by(id: @holiday.calendar_id).invite_token),
          notice: "Holiday was successfully updated." }

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @prev_calendar_id = Calendar.find_by(id: @holiday.calendar_id)