app/controllers/holidays_controller.rb

SELECT "holidays".* FROM "holidays"
---
  def index
    @holidays = Holiday.all

DELETE FROM "holidays" WHERE "holidays"."id" = $1  [["id", 980190962]]
---
  def destroy
    @holiday.destroy

SELECT "holidays".* FROM "holidays" WHERE "holidays"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_holiday
      @holiday = Holiday.find(params[:id])