app/controllers/other_events_controller.rb

SELECT "other_events".* FROM "other_events"
---
  def index
    @other_events = OtherEvent.all

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "other_events".* FROM "other_events" WHERE "other_events"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
  def create
    @other_event = OtherEvent.new(other_event_params)
    respond_to do |format|
      if @other_event.save
        format.html { redirect_to calendar_other_event_path(Calendar.find_by(id: @other_event.calendar_id).invite_token, @other_event.slug),
          notice: "Event was successfully created."}

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @other_event.slug = nil if @other_event.name != params[:name]
    puts other_event_params
    respond_to do |format|
      if @other_event.update(other_event_params)
        format.html { redirect_to calendar_path(Calendar.find_by(id: @other_event.calendar_id)),
          notice: "Other event was successfully updated."}

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "other_events" WHERE "other_events"."id" = $1  [["id", 980190962]]
---
  def destroy
    prev_calendar_id = Calendar.find_by(id: @other_event.calendar_id)
    @other_event.destroy

SELECT "other_events".* FROM "other_events" WHERE "other_events"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_other_event
      @other_event = OtherEvent.find(params[:id])