app/controllers/user_calendars_controller.rb

  def index
    @user_calendars = UserCalendar.all
---
SELECT "user_calendars".* FROM "user_calendars"

  def destroy
    @user_calendar.destroy
---
DELETE FROM "user_calendars" WHERE "user_calendars"."id" = $1  [["id", 980190962]]

    def set_user_calendar
      @user_calendar = UserCalendar.find(params[:id])
---
SELECT "user_calendars".* FROM "user_calendars" WHERE "user_calendars"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]